linkid-sdk-saml2/src/test/resources/test-ws-security-username-token-valid-message-plaintext.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
               xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/                http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1">
            <wsse:UsernameToken wsu:Id="UsernameToken-8">
                <wsse:Username>foo</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">bar</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">HDk62NS7c4mhJERQ+CHAdg==</wsse:Nonce>
                <wsu:Created>2014-01-22T13:41:01.750Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <tns:root xmlns:tns="urn:test">Hello World</tns:root>
    </soap:Body>
</soap:Envelope>